swt/software_quality.html
---
layout: page
title: Software_quality
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Qualitätsanfoderungen an Software</h2>
<div class="outline-text-2" id="text-1">
<p>
Axiom: guter Entwicklungsprozess =&gt; gute interne Qualität =&gt; gute
externe Qualität =&gt; gute Benutzungsqualität. Ziel ist es daher die
interne Qualität zu erhöhen, um externe Qualität zu erreichen.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> interne Qualität</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Die Gesamtheit der Gütemerkmale von Software aus
herstellungsorientierter Sicht.
</p>

<ul class="org-ul">
<li><i>Wartbarkeit</i>:
</li>
<li><i>Modularität</i>:
</li>
<li><i>Wiederverwendbarkeit</i>:
</li>
<li><i>Kapselung</i>:
</li>
<li><i>Strukturiertheit</i>: Der Code einer Applikation sollt strukturiert
sein, damit andere Entwickler sich für Änderungen bzw. Erweiterungen
leichter in den Code einfinden können.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> externe Qualität</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Gesamtheit der technischen Gütemerkmale einer Software.
</p>

<ul class="org-ul">
<li><i>Korrektheit</i>: SW sollte fehlerfrei arbeiten (Nachweisbar z.B. durch
formale Korrektheitsbeweise)
</li>
<li><i>Stabilität</i>: SW sollte nicht abstürzen.
</li>
<li><i>Sicherheit</i>:

<ul class="org-ul">
<li><i>Safety</i>: SW stellt keine Gefahr für die Umwelt dar (keine Sach-
oder Personenschäden)
</li>
<li><i>Security</i>: SW ist geschütz vor Gefahren der Umwelt (z.B.
Schadsoftware)
</li>
</ul>
</li>

<li><i>Verfügbarkeit</i>: Die Verfügbarkeit eines Produkts sollte hoch sein,
d.h., dass das Produkt für den Kunden immer zugänglich sein sollte.
</li>
<li><i>Benutzerfreundlichkeit</i>: Erleichtert es Benutzern/Kunden sich in das
Programm einzuarbeiten.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Gebrauchsqualität</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Gesamtheit der Gütemerkmale einer Software aus Anwedersicht (/Inwieweit
ist eine Anwender in seinem Kontext in der Lage seine agngestreben Ziele
zu erreichen?/).
</p>
</div>
</div>
</div>
